Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cert_manager.kubernetes_manifest.wildcard_certificate must be replaced
-/+ resource "kubernetes_manifest" "wildcard_certificate" {
      ~ manifest = {
          ~ metadata   = {
                name      = "wildcard-goboolean-io"
              ~ namespace = "cert-manager" -> "istio-system"
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
                name                       = "wildcard-goboolean-io"
              ~ namespace                  = "cert-manager" -> "istio-system"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          ~ spec       = {
              + additionalOutputFormats = (known after apply)
              + commonName              = (known after apply)
              + duration                = (known after apply)
              + emailAddresses          = (known after apply)
              + encodeUsagesInRequest   = (known after apply)
              + ipAddresses             = (known after apply)
              + isCA                    = (known after apply)
              ~ issuerRef               = {
                  + group = (known after apply)
                    name  = "letsencrypt-prod"
                    # (1 unchanged attribute hidden)
                }
              ~ keystores               = {
                  ~ jks    = {
                      + alias             = (known after apply)
                      + create            = (known after apply)
                      ~ passwordSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                  ~ pkcs12 = {
                      + create            = (known after apply)
                      ~ passwordSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                      + profile           = (known after apply)
                    }
                }
              + literalSubject          = (known after apply)
              ~ nameConstraints         = {
                  + critical  = (known after apply)
                  ~ excluded  = {
                      + dnsDomains     = (known after apply)
                      + emailAddresses = (known after apply)
                      + ipRanges       = (known after apply)
                      + uriDomains     = (known after apply)
                    }
                  ~ permitted = {
                      + dnsDomains     = (known after apply)
                      + emailAddresses = (known after apply)
                      + ipRanges       = (known after apply)
                      + uriDomains     = (known after apply)
                    }
                }
              + otherNames              = (known after apply)
              ~ privateKey              = {
                  + algorithm      = (known after apply)
                  + encoding       = (known after apply)
                  + rotationPolicy = (known after apply)
                  + size           = (known after apply)
                }
              + renewBefore             = (known after apply)
              + renewBeforePercentage   = (known after apply)
              + revisionHistoryLimit    = (known after apply)
              ~ secretTemplate          = {
                  + annotations = (known after apply)
                  + labels      = (known after apply)
                }
              ~ subject                 = {
                  + countries           = (known after apply)
                  + localities          = (known after apply)
                  + organizationalUnits = (known after apply)
                  + organizations       = (known after apply)
                  + postalCodes         = (known after apply)
                  + provinces           = (known after apply)
                  + serialNumber        = (known after apply)
                  + streetAddresses     = (known after apply)
                }
              + uris                    = (known after apply)
              + usages                  = (known after apply)
                # (2 unchanged attributes hidden)
            }
            # (2 unchanged attributes hidden)
        }
    }

  # module.harbor.helm_release.harbor will be created
+ resource "helm_release" "harbor" {
      + atomic                     = false
      + chart                      = "harbor"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "harbor"
      + namespace                  = "harbor"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.goharbor.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                expose:
                  type: ingress
                  tls:
                    enabled: true
                  ingress:
                    hosts:
                      core: registry.goboolean.io
                    annotations:
                      kubernetes.io/ingress.class: istio
                externalURL: https://registry.goboolean.io
            EOT,
        ]
      + verify                     = false
      + version                    = "1.15.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.namespace.kubernetes_namespace.harbor will be created
+ resource "kubernetes_namespace" "harbor" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "name" = "harbor"
            }
          + name             = "harbor"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 3 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
